#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Plates/Plates/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Plates/Plates

To view this run in a browser, visit:
https://app.terraform.io/app/lisuk-dev/plates/runs/run-oPYmBLq7yuV6bQmo

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.archive_file.function-zip: Reading...
data.archive_file.workoutLibraryCreateItem-zip: Reading...
data.archive_file.workoutLibraryGetItem-zip: Reading...
data.archive_file.workoutLibraryGet-zip: Reading...
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_dynamodb_table.workout_templates: Refreshing state... [id=WorkoutTemplates]
aws_dynamodb_table.workout_template_libraries: Refreshing state... [id=WorkoutTemplateLibraries]
aws_lambda_function.workoutLibraryGetItem: Refreshing state... [id=workoutLibraryGetItem]
aws_lambda_function.function: Refreshing state... [id=function]
aws_lambda_function.workoutLibraryCreateItem: Refreshing state... [id=workoutLibraryCreateItem]
aws_lambda_function.workoutLibraryGet: Refreshing state... [id=workoutLibraryGet]
data.archive_file.function-zip: Read complete after 1s [id=81c386d04cf5e451d763b856fea4669975b339fe]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=iam_for_lambda-20230425220706806800000001]
aws_iam_role_policy.dynamodb-lambda-policy: Refreshing state... [id=iam_for_lambda:dynamodb_lambda_policy]
aws_api_gateway_rest_api.api: Refreshing state... [id=tkxg4ll37a]
data.archive_file.workoutLibraryGet-zip: Read complete after 1s [id=872ea02a56a45df3b65480608bfcecf2c2275c58]
data.archive_file.workoutLibraryGetItem-zip: Read complete after 1s [id=e9f57b7523546e5bf43405403e1d1965dd02d850]
data.archive_file.workoutLibraryCreateItem-zip: Read complete after 1s [id=cfb77a5c87c4a4cfacbe16fb34a5bf3525f06d31]
aws_lambda_permission.workoutLibraryGetItem: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.workoutLibraryCreateItem: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.workoutLibraryGet: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.apidef will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "apidef" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            openapi: 3.0.0
            info:
              title: Plates API
              description: API for Plates Backend
              version: 1.0.0
            servers:
              - url: 'https'
            paths:
              /library:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${library_get_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            type: array
                            items:
                              $ref: '#/components/schemas/WorkoutMetadata'
                post:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${library_post_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  parameters:
                    - in: path
                      name: templateId
                      schema:
                        type: string
                        format: uuid
                      required: true
                  requestBody:
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateWorkoutTemplateRequest'
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/WorkoutTemplate'
              /library/{templateId}:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${library_item_get_arn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  parameters:
                    - in: path
                      name: templateId
                      schema:
                        type: string
                        format: uuid
                      required: true
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/WorkoutTemplate'
            
            components:
              schemas:
                CreateWorkoutTemplateRequest:
                  type: object
                  properties:
                    name:
                      type: string
                    exercises:
                      type: array
                      items:
                        $ref: '#/components/schemas/TemplateExercise'
            
                WorkoutMetadata:
                  type: object
                  properties:
                    id:
                      type: string
                      format: uuid
                    name:
                      type: string
                    version:
                      type: integer
                WorkoutTemplate:
                  type: object
                  properties:
                    id:
                      type: string
                      format: uuid
                    name:
                      type: string
                    version:
                      type: integer
                    exercises:
                      type: array
                      items:
                        $ref: '#/components/schemas/TemplateExercise'
                TemplateExercise:
                  type: object
                  properties:
                    name:
                      type: string
                    sets:
                      type: integer
                    reps:
                      type: integer
                    weight:
                      type: integer
                    rest:
                      type: integer
        EOT
      + vars     = {
          + "aws_region"           = "us-east-2"
          + "function_arn"         = "arn:aws:lambda:us-east-2:631500494754:function:function"
          + "library_get_arn"      = "arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryGet"
          + "library_item_get_arn" = "arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryGetItem"
          + "library_post_arn"     = "arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryCreateItem"
        }
    }

  # aws_api_gateway_rest_api.api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "api" {
      ~ body                         = <<-EOT
            openapi: 3.0.0
            info:
              title: Plates API
              description: API for Plates Backend
              version: 1.0.0
            servers:
              - url: 'https'
            paths:
              /library:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryGet/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            type: array
                            items:
                              $ref: '#/components/schemas/WorkoutMetadata'
                post:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryCreateItem/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  parameters:
                    - in: path
                      name: templateId
                      schema:
                        type: string
                        format: uuid
                      required: true
                  requestBody:
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: '#/components/schemas/CreateWorkoutTemplateRequest'
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/WorkoutTemplate'
              /library/{templateId}:
                get:
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:631500494754:function:workoutLibraryGetItem/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    timeoutInMillis: 20000
                    type: "aws_proxy"
                    contentHandling: "CONVERT_TO_TEXT"
                  parameters:
                    - in: path
                      name: templateId
                      schema:
                        type: string
                        format: uuid
                      required: true
                  responses:
                    '200':
                      description: OK
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/WorkoutTemplate'
            
            components:
              schemas:
                CreateWorkoutTemplateRequest:
                  type: object
                  properties:
                    name:
                      type: string
                    exercises:
                      type: array
                      items:
                        $ref: '#/components/schemas/TemplateExercise'
            
                WorkoutMetadata:
                  type: object
                  properties:
                    id:
                      type: string
                      format: uuid
                    name:
                      type: string
                    version:
                      type: integer
                WorkoutTemplate:
                  type: object
                  properties:
                    id:
                      type: string
                      format: uuid
                    name:
                      type: string
                    version:
                      type: integer
                    exercises:
                      type: array
                      items:
                        $ref: '#/components/schemas/TemplateExercise'
                TemplateExercise:
                  type: object
                  properties:
                    name:
                      type: string
                    sets:
                      type: integer
                    reps:
                      type: integer
                    weight:
                      type: integer
                    rest:
                      type: integer
        EOT -> (known after apply)
        id                           = "tkxg4ll37a"
        name                         = "PlatesApi"
        tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "function"
      ~ last_modified                  = "2023-04-27T16:28:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "4xQhKbgHRbkkKs9/tjTQo04Hj7MFZjTCseOjfwQjQXY=" -> "data.archive_file.function-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.workoutLibraryCreateItem will be updated in-place
  ~ resource "aws_lambda_function" "workoutLibraryCreateItem" {
        id                             = "workoutLibraryCreateItem"
      ~ last_modified                  = "2023-04-27T16:28:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "aWBlD+2qsjqVCRRpkuh9DnBvudUz5c4Sy1fkYErN5pQ=" -> "data.archive_file.workoutLibraryCreateItem-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.workoutLibraryGet will be updated in-place
  ~ resource "aws_lambda_function" "workoutLibraryGet" {
        id                             = "workoutLibraryGet"
      ~ last_modified                  = "2023-04-27T16:28:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "HAjd92T1deB3jb7/xA97hA91PyGJzE52PlUuk40SL6I=" -> "data.archive_file.workoutLibraryGet-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.workoutLibraryGetItem will be updated in-place
  ~ resource "aws_lambda_function" "workoutLibraryGetItem" {
        id                             = "workoutLibraryGetItem"
      ~ last_modified                  = "2023-04-27T16:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "zd2LxEjV+noYqnGIl+3VIz7vuGlagKPJcC1OpeTOBZ0=" -> "data.archive_file.workoutLibraryGetItem-zip.output_base64sha256"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.


```
</details>
*Pushed by: @lisukdev, Action: `pull_request`*